#Использовать asserts
#Использовать extensions

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ВернутьТипыСборки");
	
	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ВернутьТипыСборки() Экспорт
	РефлекторСборок = Новый РефлекторСборок();
	РефлекторСборок.ЗагрузитьСборку("c:/Users/ushakov/Documents/portable/OneScript/lib/extensions/bin/onescript-extensions.dll");

	Типы = РефлекторСборок.ПолучитьТипы();

	Для каждого Тип Из Типы Цикл
		Сообщить(Тип.ПолноеИмя);
	КонецЦикла;
	
КонецПроцедуры

