#Использовать asserts
#Использовать extensions

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ВернутьДоступноеМесто");
	// СписокТестов.Добавить("Тест_Должен_ВернутьЭто64Бита");
	// СписокТестов.Добавить("Тест_Должен_ВернутьКоличествоПроцессоров");
	// СписокТестов.Добавить("Тест_Должен_ВернутьРазмерСистемнойСтраницы");
	// СписокТестов.Добавить("Тест_Должен_ВернутьВремяРаботыСМоментаЗагрузки");
	// СписокТестов.Добавить("Тест_Должен_ВернутьАргументыКоманднойСтроки");
	// СписокТестов.Добавить("Тест_Должен_ВернутьИменаЛогическихДисков");
	// СписокТестов.Добавить("Тест_Должен_ВернутьСпециальнаяПапка");
	// СписокТестов.Добавить("Тест_Должен_ВернутьКаталогСпециальнойПапки");
	
	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ВернутьДоступноеМесто() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске();
	Ожидаем.Что(ИнформацияОДиске.Доступно).Больше(0);
КонецПроцедуры


